from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("铛铛铛-铛铛，注意啦，开始新的一课了。")  # 文本消息  必填
m.文本消息("今天与我们一起学生比赛的是【四川水煮鱼大学】认真学习，超越他们")  # 文本消息  必填
m.文本消息("近20年的开源运动产生了深植于各信息技术领域的大量可重用资源，支撑了信息技术形成了\"计算生态\"。")
m.文本消息("首先先了解 NumPy 在数据分析学科中生态体系的位置")
m.视频消息("https://video.python123.io/sv/d195592-1751b6bd4d2/d195592-1751b6bd4d2.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：SciPy", "获得「知识卡」：matplotlib", "获得「知识卡」：pandas", "获得「知识卡」：CPython"])
m.弹出知识卡(["获得「知识卡」：Jupyter", "获得「知识卡」：IPython", "获得「知识卡」：SymPy", "获得「知识卡」：Scikit-learn"])
m.文本消息("可以说 NumPy 是数据分析方向的基础库，学好 NumPy 库是学习数据分析的第一步,加油~✊")
m.文本消息("NumPy以外的数据分析方向第三方库，如pandas、Matplotlib我们会在以后的课程中讲解到。")
m.文本消息("我们开始做题吧！")
m.pk("1.2四川水煮鱼大学", "https://python123.io/iclass/images/numpy/1.2.jpg")
m.课后快速选择题(96943)  # 课后抢答题，看谁速度快  必填
m.文本消息("通过一个实际例子来体验 NumPy 的强大之处！看使用 NumPy 和 Python 内置函数分别需要多长时间")
m.代码消息NumPy("百看不如一练，请修改视频中提到的代码，亲自试一试", "1.2.py")
m.文本消息("并不需要关注如何编码，在处理同样的计算 NumPy 比 Python 快的多")
m.课后单选题([95969], 10)  # 课后单选题列表  必填
m.生成消息文件("1.0.3")
