from Python123 import NMessageCommon

m = NMessageCommon()
m.文本消息("这位同学醒一醒~~ ，口水流到键盘上了！快醒醒~ ")  # 文本消息  必填
m.文本消息("你在参加高考，马上到交卷时间了，快答题吧~！ ")  # 文本消息  必填
m.课后单选题([104807, 104808, 104809], 45)  # 课后单选题列表  必填
m.程序设计题(105724)  # 程序设计题
m.文本消息("考试结束!下面开始填报志愿环节")  # 文本消息  必填
m.文本消息("根据你的考试成绩，你可以填报的学校是......")  # 文本消息  必填# 文本消息  必填
m.课后单选题([104933], 5)  # 课后单选题列表  必填
m.文本消息("恭喜你，被北京烤鸭大学录取了！")
m.图片消息("https://python123.io/images/4f/93/e6e4b6e69fb12631b7379edf2262.jpg")
m.弹出知识卡(["获得「菜谱」：北京烤鸭"])
m.文本消息("考入我们北京烤鸭大学，你就是我们的“烤鸭人”了，烤鸭烤鸭，就是“考呀考呀”天天考呀！")
m.文本消息("我们的每一堂课，都是要以烤鸭为主。抱歉，说错了，是考试为主")
m.文本消息("每一次考试，我们都要打败一个对手大学，放心，不是名牌大学，而是美食大学")
m.文本消息("我们进入下一章，开始学习“北京考呀”之路")
m.代码消息("下面是温度转换的代码，请认真阅读并理解每一行的作用", "2.3.py",
       image="https://python123.io/images/c2/9a/859e812576c4212c80a20c391178.png",
       code_type="browser")
m.生成消息文件(1.0)
