from Python123 import NMessageCommon

m = NMessageCommon()
m.文本消息("{name}您好，欢迎体验【Python 数据与可视化成长路线】互动课程 ")  # 文本消息  必填
m.文本消息("本课程由Python123出品，由北京理工大学嵩天老师，全程监制。 ")  # 文本消息  必填
m.图片消息("https://python123.io/images/fe/24/afccadbb9e3290fe4c188dfd3c29.png")
m.文本消息("嵩天，就是他啦~！我们的老师 ")  #
m.文本消息("认识他的同学，请点击下面的表情，举一下你的小手")  # 文本消息  必填# 文本消息  必填文本消息  必填
m.文本消息("好的，好的， 可以了，话不多说，正式开始")  #
m.文本消息("首先讲解一家，学习这门课程的需要哪些基础")  # 文本消息  必填# 文本消息  必填
m.文本消息("首先，你要具备一定的Python的基础知识，并且用到的时候能够想起来")  # 文本消息  必填
m.文本消息跳转站外("推荐你能把嵩老师的慕课视频学完", "慕课视频", "https://www.icourse163.org/course/BIT-268001")  # 文本消息  必填
m.图片消息("https://python123.io/images/3a/e7/d7b9c2b26bad1227684cc7615166.png")
m.文本消息("学过这门课程的同学，请发一个表情告诉我，你学的怎么样")  # 文本消息  必填# 文本消息  必填文本消息  必填
m.文本消息("有个这个基础课程的支撑，你就可以继续学习【Python 数据与可视化】的互动课程了")
m.文本消息("我就是互动课程的讲解，出题，制作人，也是Python123平台的一员")
m.文本消息("互动课程采用了，看视频，练视频代码，与其他学生PK考试的模式进行学习。")
m.文本消息("希望你能喜欢上这个全新的学习模式，祝学习愉快")
m.文本消息("下面，请点击左侧的【1.1 开始之前】进行学习")
m.生成消息文件("1.0.1")
