from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("铛铛铛，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("我们每堂课学习，都要与一起学习的其他大学进行竞赛 PK")
m.文本消息("我们今天的学习对手是【新疆烤全羊大学】")
m.文本消息("【新疆烤全羊大学】跟我们一起看视频后进行答题考试，我们要超过他们，获胜后才能进入下一堂课")
m.文本消息("现在开始上课，先来观看一段视频")

# 视频
m.视频消息("https://video.python123.io/sv/3217052a-1751b6bd4c7/3217052a-1751b6bd4c7.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：NumPy", "获得「知识卡」：数组", "获得「知识卡」：维度", "获得「知识卡」：修改", "获得「知识卡」：矩阵"])
m.弹出知识卡(["获得「知识卡」：计算科学", "获得「知识卡」：数据分析", "获得「知识卡」：傅里叶变换", "获得「知识卡」：修改", "获得「知识卡」：NumPy应用场景"])
m.文本消息("视频中的每一句都会围绕知识点来进行讲解，最好不要快进哟😄😄😄")

# 练习
m.文本消息("如果没问题，就来 PK 一下")
m.pk("1.1新疆烤全羊大学", "https://python123.io/iclass/images/numpy/1.1.jpg")
m.课后快速选择题(96942)  # 课后抢答题  必填
m.文本消息("接下来是一道单选题：")
m.课后单选题([95964], 10)  # 课后单选题列表  必填
m.生成消息文件(1.1)
