from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("叮叮叮，同学们大家好！")  # 文本消息  必填
m.文本消息("本节课，我们的对手是【麻辣小龙虾大学】，超过他们。开始上课")
m.文本消息("今天我们会来认识 NumPy 中的数组。")  # 文本消息  必填

# 场景引入
m.文本消息("大家都知道什么是数组吗？知道的请举手", Time=5)  # 文本消息  必填
m.文本消息("在计算机科学中，数组是由相同类型的元素的集合所组成的数据结构，通常会分配一块连续的内存来存储。")  # 文本消息  必填
m.文本消息("Python 的 list 就是一种数组结构， 在 NumPy 中，最重要的对象是被称为 ndarray 的数组。")  # 文本消息  必填

# 视频
m.视频消息("https://video.python123.io/sv/3687d1d7-1751b6bd4e9/3687d1d7-1751b6bd4e9.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：数组", "获得「知识卡」：ndarray对象", "获得「知识卡」：np.array"])
m.文本消息("在 Python 中如果我们要使用 NumPy 数组,需要将列表转换为 ndarray 类型")  # 文本消息  必填
m.pk("2.1麻辣小龙虾大学", "https://python123.io/iclass/images/numpy/2.1.jpg")
m.课后快速选择题(96944)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("百看不如一练，请修改视频中提到的代码，亲自试一试", "2.1.py")
m.课后单选题([95973, 95974, 95975], 25)  # 课后单选题列表  必填
m.程序设计题(95976)  # 程序设计题
m.生成消息文件(2.1)
