from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("叮铃铃，开始上课喽。")  # 文本消息  必填
m.文本消息("今天的学习对手是【上海小笼包大学】，下面开始吧！")  # 文本消息  必填

# 场景引入
m.文本消息("有这样一个场景，当我们的代码从外部接收到了一个约 200MB 大小的 NumPy 数组")
m.文本消息("我们怎么知道这个数组是怎么排列的呢？它是一维的数据，还是二维数据，还是...")

# 视频
m.视频消息("https://video.python123.io/sv/42c65e07-1751b6bd50e/42c65e07-1751b6bd50e.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：ndarray.ndim", "获得「知识卡」：ndarray.shape", "获得「知识卡」：ndarray.size", "获得「知识卡」：ndarray.itemsize",
         "获得「知识卡」：查询数组大小"])
m.课后快速选择题(96946)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("百看不如一练，请修改视频中提到的代码，亲自试一试", "2.3.py")
m.文本消息("PK 开始！")
m.pk("2.3上海小笼包大学", "https://python123.io/iclass/images/numpy/2.3.jpg")
m.课后单选题([95966, 104184, 104185, 104186], 60)  # 课后单选题列表  必填
m.程序设计题(101086)  # 程序设计题
m.生成消息文件(2.3)
