from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("咣铛咣铛咣当，开始上课了。")  # 文本消息  必填
m.文本消息("今天【大连火爆鱿鱼大学】前来踢馆，我们一起学习，超越他们")  # 文本消息  必填

# 场景引入
m.文本消息("在 Python 中，我们使用 int() 和 str() 等方法来转换数据类型")
m.文本消息("对于 NumPy 数组应该怎么办呢？")

# 视频
m.视频消息("https://video.python123.io/sv/20336b8b-1751b6be69b/20336b8b-1751b6be69b.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.astype", "获得「知识卡」：np.tolist"])
m.课后快速选择题(96948)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("尝试将数组转换为不同的类型，观察输出结果有何不同", "2.5.py")
m.pk("2.5大连火爆鱿鱼大学", "https://python123.io/iclass/images/numpy/2.5.jpg")
m.课后单选题([104191, 104192, 104786], 60)  # 课后单选题列表  必填
m.程序设计题(104193)  # 程序设计题
m.生成消息文件(2.5)
