from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("叮叮铛，叮叮当，同学们开始上课了。")  # 文本消息  必填
m.文本消息("今天前来和我们一起学习的是【西湖醋鱼大学】")  # 文本消息  必填

# 场景引入
m.文本消息("这堂课我们学习使用 NumPy 库的一些函数和方法用于对一维数据进行处理")
m.文本消息("一维数据的索引切片，ndarray 数组与 Python 列表只有一点点的区别")
m.文本消息("我们来一起看一下")

# 视频
m.视频消息("https://video.python123.io/sv/42b6c03-1751b6be787/42b6c03-1751b6be787.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：数组索引", "获得「知识卡」：布尔索引", "获得「知识卡」：数组切片"])
m.课后快速选择题(96949)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("索引取值练习", "3.1.1.py")
m.代码消息NumPy("布尔索引练习", "3.1.2.py")
m.代码消息NumPy("尝试修改切片值，观察原数组是否发生变化", "3.1.3.py")
m.文本消息("学习结束，开始考试")  # 文本消息  必填
m.pk("3.1西湖醋鱼大学", "https://python123.io/iclass/images/numpy/3.1.jpg")
m.课后单选题([104789, 104792, 104794], 90)  # 课后单选题列表  必填
m.程序设计题(101091)  # 程序设计题
m.程序设计题(101092)  # 程序设计题
m.生成消息文件(3.1)
