from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("叮咚，叮咚，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("今天前来和我们一起学习的是【红烧肉大学】")  # 文本消息  必填

# 场景引入
m.文本消息("在 Python 中如果我们想要迭代计算多个列表中的元素的值，需要使用 for 循环来遍历列表进行操作")
m.文本消息("有了 NumPy，我们可以使用一种更简洁的方法来进行数组间元素的运算，一起来看学习吧！😇")

# 视频
m.视频消息("https://video.python123.io/sv/46f8fca5-1751b6be982/46f8fca5-1751b6be982.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.logical_and", "获得「知识卡」：np.where"])
m.课后快速选择题(96951)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("尝试对数组进行四则运算", "3.3.1.py")
m.代码消息NumPy("尝试更复杂的逻辑运算和多远运算", "3.3.2.py")
m.文本消息("NumPy 库将数组间的元素运算，变的像加减乘除一样简单")
m.文本消息("今天是一场友谊赛，友谊赛我们也要获胜")  # 文本消息  必填
m.pk("3.3红烧肉大学", "https://python123.io/iclass/images/numpy/3.3.jpg")
m.课后单选题([104800, 104801], 40)  # 课后单选题列表  必填
m.程序设计题(101094)  # 程序设计题
m.程序设计题(101095)  # 程序设计题
m.程序设计题(101114)  # 程序设计题
m.程序设计题(101115)  # 程序设计题
m.生成消息文件(3.3)
