from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("呼啦啦，呼啦啦，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("今天前来和我们一起学习的是【驴肉火烧大学】")  # 文本消息  必填

# 场景引入
m.文本消息("在 NumPy 中如何进行数组的排序？怎么插入新的元素？如何去搜索数组中的元素？怎么统计数组中的元素？")
m.文本消息("带着这些问题我们来一起观看视频吧~")

# 视频
m.视频消息("https://video.python123.io/sv/2e867947-1751b6bfecb/2e867947-1751b6bfecb.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.sort", "获得「知识卡」：np.searchsorted", "获得「知识卡」：np.where"])
m.课后快速选择题(96952)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("练习生成并展示一组随机数据", "3.4.1.py")
m.代码消息NumPy("对数据排序并展示 - 1", "3.4.2.py")
m.代码消息NumPy("对数据排序并展示 - 2", "3.4.3.py")
m.代码消息NumPy("排序统计和搜索数组", "3.4.4.py")
m.文本消息("一起来考试，让我们干掉这份驴肉火烧")  # 文本消息  必填
m.pk("3.4驴肉火烧大学", "https://python123.io/iclass/images/numpy/3.4.jpg")
m.课后单选题([104197], 10)  # 课后单选题列表  必填
m.程序设计题(101120)  # 程序设计题
m.生成消息文件(3.4)