from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("呼噜噜，呼噜噜，同学们注意了开始上课了。")
m.文本消息("今天前来和我们一起学习的是【重庆鸳鸯火锅大学】，加油！")  # 文本消息  必填# 文本消息  必填

# 场景引入
m.文本消息("这堂课我们开始学习 NumPy 的数组统计方法。")
m.文本消息("相信同学们都听过 MapReduce，简单的说就是将数组进行多步映射计算（Map），最终整合为一个统计结果（Reduce），而统计方法，面向的就是 Reduce 过程。")
m.文本消息("MapReduce 是数据分析中的核心理念，理解这一过程，能帮助我们编写更灵活的的代码。")

# 视频
m.视频消息("https://video.python123.io/sv/450870ed-1751b6c0649/450870ed-1751b6c0649.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.sum", "获得「知识卡」：np.mean", "获得「知识卡」：np.std", "获得「知识卡」：np.average", "获得「知识卡」：np.cumsum"])
m.弹出知识卡(["获得「知识卡」：np.cumprod", "获得「知识卡」：np.unique", "获得「知识卡」：np.intersect1d", "获得「知识卡」：np.in1d", "获得「知识卡」：np.setxor1d"])
m.课后快速选择题(96953)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("常用统计方法练习 - 1", "3.5.1.py")
m.代码消息NumPy("常用统计方法练习 - 2", "3.5.2.py")
m.pk("3.5重庆鸳鸯火锅大学", "https://python123.io/iclass/images/numpy/3.5.jpg")
m.课后单选题([101062, 101063, 101064], 25)  # 课后单选题列表  必填
m.程序设计题(104198)  # 程序设计题
m.生成消息文件(3.5)
