from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("轰隆隆，轰隆隆，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("今天前来和我们一起学习的是【红焖羊肉大学】")  # 文本消息  必填

# 场景引入
m.文本消息("今天我们来学习使用 NumPy 读写文件。")
m.文本消息("除了 Python 的 open，NumPy 还为我们提供了一些专门用于保存数组的函数，一起来学习下吧~")

# 视频
m.视频消息("https://video.python123.io/sv/1e4f154e-1751b6c0645/1e4f154e-1751b6c0645.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.cos", "获得「知识卡」：np.save", "获得「知识卡」：np.savez", "获得「知识卡」：np.savetxt", "获得「知识卡」：np.load"])
m.弹出知识卡(["获得「知识卡」：np.loadtxt", "获得「知识卡」：np.copy", "获得「知识卡」：np.tile", "获得「知识卡」：ndarray.view"])
m.课后快速选择题(96954)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("试一试保存和读取 npy 文件", "3.6.1.py")
m.代码消息NumPy("试一试保存和读取 npz 文件", "3.6.2.py")
m.代码消息NumPy("试一试手动指定保存数组的名称", "3.6.3.py")
m.代码消息NumPy("尝试保存和读取 csv 文件", "3.6.4.py")
m.代码消息NumPy("复制数组的各种方式", "3.6.5.py")
m.代码消息NumPy("尝试创建和修改数组视图", "3.6.6.py")
m.文本消息("学好了吗？今晚一起吃红焖羊肉")  # 文本消息  必填
m.pk("3.6红焖羊肉大学", "https://python123.io/iclass/images/numpy/3.6.jpg")
m.课后单选题([104238, 104243, 104247], 25)  # 课后单选题列表  必填
m.程序设计题(101127)  # 程序设计题
m.生成消息文件(3.6)
