from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("乒乒乓乓，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("本节课对战的学校是【四川麻婆豆腐大学】，加油！")  # 文本消息  必填

# 场景引入
m.文本消息("前面的课程中我们知道，数组中只能保存一种类型的数据。但事实上，NumPy 支持把多种类型的数据整合为一个「结构」类型，并指定数组的类型为这个「结构」。")
m.文本消息("如何进行操作呢？下面我们开始学习吧！")

# 视频
m.视频消息("https://video.python123.io/sv/575eedea-1751b6c066d/575eedea-1751b6c066d.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：类型代码", "获得「知识卡」：结构化阵列"])
m.课后快速选择题(96955)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("创建复合类型的练习", "3.7.py")
m.文本消息("课程结束， 开始对战！")  # 文本消息  必填
m.pk("3.7四川麻婆豆腐大学", "https://python123.io/iclass/images/numpy/3.7.jpg")
m.程序设计题(101128)  # 程序设计题
m.生成消息文件(3.7)
