from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("咣噹，咣噹，同学们开始上课了。")  # 文本消息  必填
m.文本消息("今天与我们一起竞赛学习的是【铁锅炖大鹅大学】")  # 文本消息  必填
m.文本消息("希望同学们在与【铁锅炖大鹅大学】的学习竞赛中顺利胜出")  # 文本消息  必填

# 场景引入
m.文本消息("从这堂课开始，我们将进入多维数据的世界。")
m.文本消息("多维数据处理相较于一维更为抽象，也更为常用，相信同学们在熟悉了一维数据的处理方法以后，能够轻松理解接下来的内容。")
m.文本消息("下面我们开始吧！")

# 视频
m.视频消息("https://video.python123.io/sv/22f7c25f-1751b6c07a0/22f7c25f-1751b6c07a0.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：维度与轴", "获得「知识卡」：np.reshape"])
m.课后快速选择题(96956)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("查看多维数据的形状和元素值", "4.1.py")
m.文本消息("维度与轴的概念比较抽象，同学们要仔细理解，现在开始 PK")
m.pk("4.1铁锅炖大鹅大学", "https://python123.io/iclass/images/numpy/4.1.jpg")
m.课后单选题([101065, 104765, 104766], 30)  # 课后单选题列表  必填
m.程序设计题(104251)  # 程序设计题
m.生成消息文件(4.1)
