from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("叮噹，叮噹，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("今天与我们对战的是【重庆酸菜鱼大学】，学习开始")  # 文本消息  必填

# 场景引入
m.文本消息("二维数据的索引和切片与一位数据有一些不同，具体有那些呢？")

# 视频
m.视频消息("https://video.python123.io/sv/669eeaa-1751b6c1522/669eeaa-1751b6c1522.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：索引切片"])
m.课后快速选择题(96957)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("试一试二维数组的索引和切片操作", "4.2.py")
m.文本消息("现在开始考试~！吃光酸菜鱼")  # 文本消息  必填
m.pk("4.2重庆酸菜鱼大学", "https://python123.io/iclass/images/numpy/4.2.jpg")
m.课后单选题([104751, 104752], 60)  # 课后单选题列表  必填
m.程序设计题(101129)  # 程序设计题
m.生成消息文件(4.2)
