from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("咚咚咚咚咚，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("今天的对手是【重庆辣子鸡大学】")  # 文本消息  必填

# 场景引入
m.文本消息("在 3.4 课中我们介绍过一维数组的排序和搜索，那么在二维数据中有那些不同呢？")

# 视频
m.视频消息("https://video.python123.io/sv/37148dd8-1751b6c1b36/37148dd8-1751b6c1b36.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：排序", "获得「知识卡」：np.where"])
m.课后快速选择题(96958)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("试一试沿不同轴排序的结果", "4.3.1.py")
m.代码消息NumPy("试一试 where 方法", "4.3.2.py")
m.文本消息("下面开始 PK！今晚我们就来吃——重庆辣子鸡")  # 文本消息  必填
m.pk("4.3重庆辣子鸡大学", "https://python123.io/iclass/images/numpy/4.3.jpg")
m.课后单选题([104753], 30)  # 课后单选题列表  必填
m.程序设计题(101130)  # 程序设计题
m.生成消息文件(4.3)
