from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("哐啷哐啷，哐啷哐啷，同学们上课了。")  # 文本消息  必填
m.文本消息("本节课对手【九转大肠大学】")  # 文本消息  必填

# 场景引入
m.文本消息("这堂课我们来学习多维数组的统计方法，基本上是与一维类似的，不过在进行集合运算时有一些需要注意的事项。")
m.文本消息("话不多说，来看视频吧！")

# 视频
m.视频消息("https://video.python123.io/sv/4847b49f-1751b6c1e4a/4847b49f-1751b6c1e4a.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.sum", "获得「知识卡」：np.mean", "获得「知识卡」：np.std", "获得「知识卡」：np.average", "获得「知识卡」：np.cumsum"])
m.弹出知识卡(["获得「知识卡」：np.cumprod", "获得「知识卡」：np.unique", "获得「知识卡」：np.in1d", "获得「知识卡」：np.setdiff1d", "获得「知识卡」：np.setxor1d"])
m.课后快速选择题(96959)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("练一练基本的统计方法在多维数据上的应用", "4.4.py")
m.文本消息("下面开始 PK！九转大肠是山东第一美味菜，今晚一定吃掉它")  # 文本消息  必填
m.pk("4.4九转大肠大学", "https://python123.io/iclass/images/numpy/4.4.jpg")
m.课后单选题([104764], 15)  # 课后单选题列表  必填
m.程序设计题(101131)  # 程序设计题
m.生成消息文件(4.4)
