from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("叮叮咚咚，同学们注意了开始上课了。")  # 文本消息  必填
m.文本消息("本节课对手【爆炒腰花大学】")  # 文本消息  必填

# 场景引入
m.文本消息("这一堂课，我们将学习 NumPy 多维运算中最为抽象的概念——广播，理解广播机制能够帮助我们编写更简化的代码。")

# 视频
m.视频消息("https://video.python123.io/sv/2f629aa0-1751b6c2148/2f629aa0-1751b6c2148.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：广播"])
m.课后快速选择题(96960)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("矢量运算练一练", "4.5.py")
m.文本消息("下面开始今天的学习对战！")  # 文本消息  必填
m.pk("4.5爆炒腰花大学", "https://python123.io/iclass/images/numpy/4.5.jpg")
m.课后单选题([101066], 20)  # 课后单选题列表  必填
m.生成消息文件(4.5)
