from Python123 import NMessageCommon

m = NMessageCommon()

m.选择同桌()  # 选择用户  必填
m.文本消息("啦啦啦啦啦啦，同学们开始上课了。")  # 文本消息  必填
m.文本消息("今天挑战的是【糖醋鲤鱼大学】开始上课")  # 文本消息  必填

# 场景引入
m.文本消息("这一章的末尾，我们来了解 NumPy 中的矩阵运算。")
m.文本消息("如果我们在数据处理时需要用到复杂的矩阵运算方法，别忘了 NumPy 中还有线性代数库 linalg 函数库供我们使用。下面就来了解一下。")

# 视频
m.视频消息("https://video.python123.io/sv/204e7fed-1751b6c242b/204e7fed-1751b6c242b.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：np.dot", "获得「知识卡」：np.transpose"])
m.课后快速选择题(96961)  # 课后抢答题  必填

# 练习
m.代码消息NumPy("试一试矩阵乘法和转置操作", "4.6.py")
m.文本消息("糖醋鲤鱼不吃不知道， 一吃忘不掉，今晚就战它")  # 文本消息  必填
m.pk("4.6糖醋鲤鱼大学", "https://python123.io/iclass/images/numpy/4.6.jpg")
m.课后单选题([104745, 104748, 104749], 30)  # 课后单选题列表  必填
m.程序设计题(101132)  # 程序设计题
m.生成消息文件(4.6)
