from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("嘎嘎嘎嘎，同学们注意了开始上课了。")  # 文本消息  必
m.文本消息("今天我们要挑战的是：【葱烧海参大学】")  # 文本消息  必填

# 场景引入
m.文本消息("首先恭喜大家，NumPy 的大多数知识点我们都已经学完啦！")
m.文本消息("从本堂课开始，我们将以图片处理为例，帮助大家熟悉 NumPy 的使用。下面开始吧！")

# 视频
m.视频消息("https://video.python123.io/sv/1dbc0ded-1751b6c29c0/1dbc0ded-1751b6c29c0.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：打开图片", "获得「知识卡」：查看图片形状", "获得「知识卡」：图片上下翻转", "获得「知识卡」：图片左右翻转", "获得「知识卡」：图片高度剪切"])
m.弹出知识卡(["获得「知识卡」：图片宽度剪切", "获得「知识卡」：图片指定区间剪切", "获得「知识卡」：图片色值修改", "获得「知识卡」：图片保存"])
m.课后快速选择题(96962)  # 课后抢答题  必填

# 练习
m.代码消息NumPy_需添加附件("打开图片、显示图片、查看图片属性", "5.1.1.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片翻转 - 1", "5.1.2.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片翻转 - 2", "5.1.3.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片裁剪 - 1", "5.1.4.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片裁剪 - 2", "5.1.5.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片裁剪 - 3", "5.1.6.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("试一试给图片加边框", "5.1.7.py", "lighthouse.jpg")
m.文本消息("是不是很简单，我们来实际动手操作下，用海参来补补身体")
m.pk("5.1葱烧海参大学", "https://python123.io/iclass/images/numpy/4.6.jpg")
m.课后单选题([105270, 105265],20)  # 课后单选题列表  必填
m.程序设计题(101133)  # 程序设计题
m.生成消息文件(5.1)
