from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("嗡嗡嗡 嗡嗡嗡，开始上课了。")  # 文本消息  必填
m.文本消息("本堂课程对手【四喜丸子大学】")  # 文本消息  必填

# 场景引入
m.文本消息("这一堂课，我们来学习处理图片数组的颜色维度，下面开始吧！")

# 视频
m.视频消息("https://video.python123.io/sv/18805408-1751b6c3520/18805408-1751b6c3520.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：灰度图处理", "获得「知识卡」：对比度增强", "获得「知识卡」：图片变红"])
m.课后快速选择题(96964)  # 课后抢答题  必填

# 练习
m.代码消息NumPy_需添加附件("灰度图处理", "5.3.1.py", "lighthouse2.jpg")
m.代码消息NumPy_需添加附件("对比度增强", "5.3.2.py", "lighthouse2.jpg")
m.代码消息NumPy_需添加附件("图片变红", "5.3.3.py", "lighthouse.jpg")
m.文本消息("下面开始 PK，四喜丸子，非常好吃， 大丸子有拳头大")  # 文本消息  必填
m.pk("5.3四喜丸子大学", "https://python123.io/iclass/images/numpy/5.3.jpg")
m.课后单选题([101069, 101070], 25)  # 课后单选题列表  必填
m.生成消息文件(5.3)
