from Python123 import NMessageCommon

m = NMessageCommon()
m.选择同桌()  # 选择用户  必填
m.文本消息("呱呱呱 呱呱呱，同学们上课了。")  # 文本消息  必填
m.文本消息("本次对手【德州扒鸡大学】")  # 文本消息  必填

# 场景引入
m.文本消息("经过这么多的练习，是不是对于图片数组的处理能力更上一层楼了😃😃😃")
m.文本消息("最后这堂课我们来用 NumPy 给图片加！滤！镜！")

# 视频
m.视频消息("https://video.python123.io/sv/3320cd81-1751b6c368d/3320cd81-1751b6c368d.mp4")  # 视频播放地址  必填
m.弹出知识卡(["获得「知识卡」：图片故障效果", "获得「知识卡」：图片马赛克", "获得「知识卡」：淡化效果处理"])
m.课后快速选择题(96965)  # 课后抢答题  必填

# 练习
m.代码消息NumPy_需添加附件("图片故障效果", "5.4.1.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片像素化滤镜", "5.4.2.py", "lighthouse.jpg")
m.代码消息NumPy_需添加附件("图片淡出滤镜", "5.4.3.py", "lighthouse.jpg")
m.文本消息("烤鸭战扒鸡，大吉大利，今夜吃鸡！就看你的了！~")  # 文本消息  必填
m.pk("5.4德州扒鸡大学", "https://python123.io/iclass/images/numpy/5.4.jpg")
m.程序设计题(105882)  # 程序设计题
m.生成消息文件(5.4)
