Repository: pypi-data/pypi-mirror-98
Catalog: packages/pyams-auth-azure/pyams_auth_azure-1.1.1-py3.8.egg/pyams_auth_azure/locales/*/LC_MESSAGES/pyams_auth_azure.po
Languages: fr

source: Azure authentication
fr: Authentification Azure

source: Enable Azure authentication?
fr: Activer l'authentification Azure ?

source: Enable login via Azure authentication
fr: Activer la connexion via une authentification par le portail Azure

source: Client ID
fr: ID client

source: Application client ID
fr: ID client de l'application

source: Secret key
fr: Clé secrète

source: Application secret key
fr: Clé secrète de l'application

source: Authentication authority
fr: Autorité d'authentification'

source: URL of the authentication authority
fr: URL de l'autorité d'authentification utilisée pour valider les jetons

source: Verify SSL?
fr: Vérification SSL

source: If 'no', SSL certificates will not be verified
fr: Si 'non', les certificats SSL ne seront pas vérifiés

source: Authorization header
fr: En-tête d'autorisation

source: Name of the HTTP header containing authentication token
fr: Nom de l'en-tête HTTP contenant le jeton d'authentification

source: Authorization scheme
fr: Schéma d'authentification

source: Name of the prefix used in HTTP header
fr: Préfixe utilisé dans l'en-tête HTTP d'authentification

source: Test header
fr: En-tête de test

source: If this header is set and present into request headers (with any value), the authorization header value will be used "as is" without any Azure authentication to get user's login...
fr: Si le nom de cet en-tête est paramétré et s'il est présent dans les en-têtes HTTP reçus (quelle qu'en soit la valeur), l'en-tête d'authentification sera traité "en l'état" sans appel à Azure pour extraire le login de l'utilisateur...

source: Use authorization cache?
fr: Mettre les jetons en cache ?

source: If selected, this option allows to store credentials in a local cache from which they can be reused
fr: Lorsqu'elle est activée, cette option permet de stocker les jetons authentifiés et vérifiés dans un cache local d'où ils pourront être récupérés pour différentes requêtes, sans nécessité de faire appel au portail Azure

source: Selected tokens cache
fr: Cache de jetons

source: Beaker cache selected to store validated tokens
fr: Cache pré-défini dans lequel seront stockés les jetons

source: Client ID, secret key and authentication authority are required to enable Azure authentication
fr: L'ID client, la clé secrète et l'autorité d'authentification sont obligatoires pour activer l'authentification Azure

source: Azure configuration
fr: Configuration Azure

source: Security manager
fr: Gestionnaire de sécurité

source: Azure authentication plug-in support the "on-behalf-of" flow, where a resource declared on the Azure portal can be accessed, using an MSAL client package, through an application proxy. The original Azure authentication token received by the "client" is then forwarded to the Pyramid application server, using another HTTP header; the application can then use the Azure API to check token validity and extract some of it's credentials (like a user ID) for which a lookup will be made into another internal users directory...
fr: Le module d'authentification Azure supporte le flux "on-behalf-of", dans lequel une resource, déclarée sur le portail Azure, est accédée par une application "externe", utilisant une librairie MSAL cliente et authentifiée sur ce portail. Le jeton d'authentification initial fourni par Azure à ce "client" doit alors être transmis à l'application Pyramid, via un autre en-tête HTTP ; l'application peut alors extraire ce jeton, vérifier sa validité (via un appel au portail Azure) et en extraire les paramètres de connexion de l'utilisateur pour faire une recherche dans un annuaire d'utilisateurs local (ou un annuaire LDAP). La mise en place d'un cache (d'uné durée limitée !) permet de réduire les appels au portail Azure.
