Repository: pypi-data/pypi-mirror-98
Catalog: packages/django-mp-basement/django-mp-basement-2.5.tar.gz/django-mp-basement-2.5/basement/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Selected http method is not supported.
uk: Вибраний http метод не підтримується.

source: Creation date
uk: Дата створення

source: File
uk: Файл

source: Is completed
uk: Виконано

source: Is processing
uk: В обробці

source: Status
uk: Статус

source: Percent
uk: Відсоток

source: Import task
uk: Завдання імпорту

source: Import tasks
uk: Завдання імпорту

source: Save
uk: Зберегти

source: Toggle Dropdown
uk: Переключити

source: Save and continue
uk: Зберегти та продовжити

source: Save and add more
uk: Зберегти та додати ще
