Repository: pypi-data/pypi-mirror-98
Catalog: packages/pyams-auth-oauth/pyams_auth_oauth-1.2.0-py3.8.egg/pyams_auth_oauth/locales/*/LC_MESSAGES/pyams_auth_oauth.po
Languages: fr

source: Enable OAuth login?
fr: Activer la connexion OAuth/OAuth2 ?

source: Enable login via OAuth authentication
fr: Activer l'authentification via un fournisseur OAuth

source: OAuth users folder
fr: Dossier d'utilisateurs

source: Name of folder used to store properties of users authenticated with OAuth
fr: Nom du dossier utilisé pour stocker les propriétés des utilisateurs authentifiés via OAuth

source: Authomatic secret
fr: Code secret

source: This secret phrase is used to encrypt Authomatic cookie
fr: Ce code secret est utilisé pour l'encryptage des cookies d'authentification

source: Use OAuth popup?
fr: Utiliser une popup de connexion ?

source: If 'yes', a connection popup will be used
fr: Si 'oui', la connexion à votre fournisseur se fera via une popup

source: Provider ID
fr: ID du fournisseur

source: This value should be unique between all providers
fr: Cette valeur doit être unique entre tous les fournisseurs d'authentification déclarés

source: Provider name
fr: Nom du fournisseur

source: Provider consumer key
fr: Clé consommateur

source: This consumer key is given by your OAuth provider...
fr: Cette clé consommateur est donnée par votre fournisseur d'authentification...

source: Provider secret
fr: Clé secrète

source: This secret key is given by your OAuth provider...
fr: Cette clé secrète est donnée par votre fournisseur d'authentification...

source: Access headers
fr: En-têtes d'accès

source: Some providers require custom headers; you can enter them in JSON format...
fr: Certains fournisseurs nécessitent des en-têtes HTTP spécifiques; vous pouvez les renseigner ici au format JSON...

source: Internal provider ID
fr: ID interne

source: OAuth provider name
fr: Nom du fournisseur

source: User name
fr: Code utilisateur

source: Name
fr: Nom

source: First name
fr: Prénom

source: Last name
fr: Nom de famille

source: Nickname
fr: Surnom

source: E-mail address
fr: Adresse mail

source: Timezone
fr: Fuseau horaire

source: Country
fr: Pays

source: City
fr: Ville

source: Postal code
fr: Code postal

source: Locale code
fr: Code de locale

source: Picture URL
fr: URL de l'image

source: Birth date
fr: Date de naissance

source: Registration date
fr: Date d'enregistrement

source: You can't activate OAuth login without selecting an OAuth users folder
fr: Vous devez sélectionner un dossier de stockage des profils utilisateurs pour pouvoir activer l'authentification OAuth

source: OAuth providers
fr: Fournisseurs OAuth

source: Provider
fr: Fournisseur

source: Registered OAuth providers
fr: Fournisseurs OAuth enregistrés

source: You can provide as many OAuth connections as you want. Each connection must have a unique integer ID.
fr: Vous pouvez fournir autant de connexions OAuth que nécessaire. Chaque connexion doit disposer d'un identifiant entier unique.

source: Add provider
fr: Ajouter un fournisseur

source: Security manager
fr: Gestionnaire de sécurité

source: Add OAuth provider
fr: Ajout d'un fournisseur OAuth

source: OAuth provider properties
fr: Propriétés du fournisseur OAuth

source: This provider ID is already used!
fr: Cet ID est déjà utilisé !

source: Invalid JSON data for access headers!
fr: Données JSON invalides pour les en-têtes d'accès !

source: OAuth configuration
fr: Configuration OAuth

source: OAuth authentication module provides features and a REST API which can be used to authenticate principals using external OAuth providers. Activating this option will require additional configuration to create a dedicated users folder to store profiles of users which will be registered using this protocol; you will also have to register API keys for providers that you want to allow connection from, before recording them in the security manager...
fr: Le module d'authentification OAuth propose des fonctionnalités et une API qui peuvent être utilisées pour authentifier des utilisateurs en utilisant des fournisseurs d'accès OAuth (1 ou 2) externes. L'activation de cette fonctionnalité demandera une configuration complémentaire, pour créer un dossier spécifique pour le stockage des profils des utilisateurs qui se seront enregistrés en utilisant ce protocole ; vous devrez également enregistrer des clés d'accès chez les fournisseurs dont vous souhaitez autoriser la connexion, avant de les enregistrer dans le gestionnaire de sécurité...

source: Add OAuth users folder...
fr: Ajouter un dossier d'utilisateurs OAuth...

source: Add OAuth users folder plug-in
fr: Ajout d'un dossier d'utilisateurs OAuth

source: OAuth users folder plug-in
fr: Dossier d'utilisateurs OAuth

source: Users search form
fr: Rechercher des utilisateurs

source: Mail address
fr: Adresse mail

source: Search results
fr: Résultats de la recherche

source: User properties
fr: Propriétés de l'utilisateur
