Repository: pypi-data/pypi-mirror-98
Catalog: packages/collective.pivot/collective.pivot-1.0a6.tar.gz/collective.pivot-1.0a6/src/collective/pivot/locales/*/LC_MESSAGES/collective.pivot.po
Languages: fr

source: Add collective.pivot content
fr: Crée le contenu de collective.pivot

source: Add new CGT Pivot category folder
fr: Créer une nouvelle catégorie CGT Pivot

source: Click here to complete setup.
fr: Cliquez ici pour finaliser la configuration.

source: Events
fr: Évènements

source: Hosting
fr: Hébergement

source: Leave empty if you want to get zip codes from global settings. Separate postal codes with a |
fr: Ne rien mettre si vous désirez utiliser les codes postaux par défaut du site. Séparez les codes postaux par un |

source: Leisure / discovery
fr: Loisirs / Découvertes

source: Pivot Settings
fr: Paramètres de Pivot

source: Pivot family
fr: Famille Pivot

source: Tourism organizations
fr: Organismes touristiques

source: Webservice (header) key
fr: Clé d'authentification Pivot (http header)

source: Webservice url
fr: Url du webservice Pivot

source: Your configuration is not complete.
fr: Votre configuration est incomplète.

source: Zip code
fr: Code postal

source: Zip codes
fr: Codes postaux
