Repository: pypi-data/pypi-mirror-98
Catalog: packages/collective.contentrules.mailfromfield/collective.contentrules.mailfromfield-1.0.1.tar.gz/collective.contentrules.mailfromfield-1.0.1/collective/contentrules/mailfromfield/locales/*/LC_MESSAGES/collective.contentrules.mailfromfield.po
Languages: it

source: A mail action that take the e-mail address from the content where the rule is activated.
it: Una azione di invio e-mail che prende l'indirizzo dal contenuto sul quale la regola è attivata

source: Add mail from field action
it: Aggiungi azione "e-mail dal contenuto"

source: Configure element
it: Configura elemento

source: From content that triggered the event
it: Dal contenuto che ha scatenato l'evento

source: From content's parent
it: Dal padre del contenuto

source: From rule's container
it: Dal contenitore delle regole

source: Mail message
it: Messaggio e-mail

source: Put there the field name from which get the e-mail. You can provide an attribute name, a method name, an AT field name or ZMI property
it: Inserisci qui il nome del campo dal quale vuoi estrarre l'e-mail. Puoi fornire il nome di un attributo, di un metodo, di un campo AT o una property ZMI

source: Sender email
it: Mittente e-mail

source: Source field
it: Campo sorgente

source: Subject
it: Oggetto

source: Subject of the message
it: Oggetto del messaggio

source: Target element
it: Obbiettivo dell'evento

source: The email address that sends the email. If no email is provided here, it will use the portal from address.
it: L'indirizzo e-mail del mittente. Se non viene specificato nessun indirizzo verranno usate le impostazioni del sito.

source: action_summary
it: E-mail agli utenti definiti dal dato "${fieldName}"

source: help_message
it: Scrivi qui il messaggio che vuoi inviare. Alcuni contenuti definiti possono essere rimpiazzati ${title} verrà rimpiazzato dal nome dell'obbiettivo dell'evento. ${url} verrà rimpiazzato dall'URL dell'obbiettivo dell'evento. ${section_url} verrà rimpiazzato dall'URL della sezione su cui la regola è applicata.

source: help_target
it: Scegli se ottenere l'indirizzo da: il contenitore dove la regola è attivata, il contenuto che ha scatenato l'evento o il padre del contenuto scatenante.
