from Python123 import MessageCommon

m = MessageCommon()

# 13-01-“温度转换”问题分析.mp4
m.检查点(10, "1.“温度转换”问题分析")
m.视频消息(100, '', 'https://video.python123.io/sv/34c57247-175de04217d/34c57247-175de04217d.mp4')

# 13-02-“温度转换”实例编写.mp4
m.检查点(20, "2.“温度转换”实例编写")
m.视频消息(200, '', 'https://video.python123.io/sv/55ed7478-175de0421d7/55ed7478-175de0421d7.mp4')

m.文本消息(201, "", "温度转换程序是一个程序设计教学中的经典案例，用于理解基本的 Python 语法元素。")
m.文本消息(202, "", "下图，左侧是代码窗口，右侧是课程中的 PPT 内容，请按照右侧的内容，敲一敲代码，一起演练一遍吧。")
m.文本消息(203, "", "不过……如果你很懒，我也可以“帮你敲”，记得发个表情给我点赞。")
m.代码消息(204, "", "对照敲出", "13.1.py",
       image="https://python123.io/images/c2/9a/859e812576c4212c80a20c391178.png",
       fill="manual",
       code_type="browser")

m.文本消息(205, "", "你正确了吗？经过几万名学生的统计，最常见的错误是下几条：<br>"
                "<br>"
                "1、 Python 语言对大小写敏感，TempStr 和 Tempstr 是两个不同的变量名称。<br>"
                "2、 Python 中标点符号都是英文的，所以使用双引号和单引号冒号时切换英文输入法。<br>"
                "3、 Python 的格式框架以缩进为主，冒号的下一行需要输入 4 个空格。<br>"
                "4、 注意：input 不能带参数，括号里为空。<br>")

# 13-03-“温度转换”举一反三.mp4
m.检查点(30, "3.“温度转换”举一反三")
m.视频消息(300, '', 'https://video.python123.io/sv/35e48804-175de04230f/35e48804-175de04230f.mp4')

m.文本消息(999, "", "今天的课程，就到此结束了，感谢你的学习。希望你能认真的，多学，多练，做好基础训练，后期的课程更有挑战，更有趣。")

m.生成消息文件(13)
