from Python123 import MessageCommon

m = MessageCommon()

# 46-01-练习与作业.mp4
m.检查点(10, "1.练习与作业")
m.视频消息(100, '', 'https://video.python123.io/sv/f406b61-175de056daa/f406b61-175de056daa.mp4')

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>第二部分，课后练习<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
# 课后练习题
m.检查点(20, "2.课后练习-身体质量指数BMI")
m.文本消息(1123, "", "看看你还记不记得你刚刚敲过的【身体质量指数BMI】这次看你的学习能力了")
# 实例1 身体质量指数BMI
m.程序设计题(113, "", 6883)  # 程序设计题
m.文本消息(114, "", "课程讲解非常详细，不做过多讲解")
m.文本消息(115, "", "我们继续下一个练习，【圆周率的计算】!")

# 实例2 圆周率的计算
m.检查点(30, "3.课后练习-")
m.程序设计题(116, "", 6884)  # 程序设计题
m.文本消息(117, "", "与课程有区别的是seed随机数种子需要设置，因为要在线评阅。")
m.文本消息(118, "", "【圆周率的计算】练习结束，我们继续学习下一个练习")

# 实例3 整数的加减和
m.检查点(40, "4.课后练习-")
m.文本消息(115, "", "下面是【整数的加减和】，很简单，做完之后给你讲解")
m.程序设计题(119, "", 6922)  # 程序设计题
m.文本消息(120, "", "1-2+3-4...966 所有数字为整数，从 1 开始递增，奇数为正，偶数为负")
m.文本消息(121, "", "如果 count 余 2 等于 0 则 s=s-count 否则 s=s+count，每判断一次 count=count+1 次")
m.文本消息(122, "", "我们下一个练习，这是一个经典练习题【水仙花数】，烧脑的时刻到了。")

# 实例4 水仙花数
m.检查点(50, "5.课后练习-")
m.程序设计题(123, "", 6938)  # 程序设计题
m.文本消息(124, "", "这里采用了s[:-1]方式不输出最后一个逗号。也可以把所有结果放到一个列表中，采用字符串的.join()方法输出结果。如下：")
m.代码消息(125, "", "示例代码", "46.1.py")
m.文本消息(126, "", "我们继续学习最后一个练习【用户的三次登录机会】")
m.文本消息(1260, "", "题目稍微有点难，不要着急，慢慢思考，反复试炼 ，这才是学习的乐趣")

# 实例5 用户的三次登陆机会
m.检查点(60, "6.课后练习-")
m.程序设计题(127, "", 6913)  # 程序设计题
m.文本消息(128, "", "这道题的解法非常多，只是推荐的一种，重点在于 while 循环的掌握，以及 break 中断退出的位置。")
m.文本消息(129, "", "我们今天的课程到这里就结束了，下面是课程学习中，同学们关心的热点问题")

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>第三部分，热点问题<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
m.检查点(70, "7.课程热点问题")
m.分支消息(130, "课程学习中，同学们关心的热点问题",
       {"1.异常类型名称": 131,
        "2.While 0和1是什么": 136,
        "3.随机种子": 138,
        "结束本节课程": 139})

# 异常类型名称
m.文本消息(131, "", "try…except 语句用来处理异常，那么你一定记得 except NameError 这段语句，除了 NameError 还提供了如下这些异常。")
m.图片消息(132, "", "https://python123.io/images/45/82/e1a69489b5a985b66e688c09e626.jpg")
m.图片消息(133, "", "https://python123.io/images/fb/f3/5339f9332261cfd26aa1be8926e5.jpg")
m.文本消息(134, 130, "同学们可以很方便的编写相关的异常处理程序。")

# While 0和1是什么？
m.文本消息(136, "",
       "for…in…range 循环语句我们已经接触非常的多，在这里不做过多讲解，对于 while 无限循环的使用同学们可能还有一些陌生，在这里告诉大家一个小知识，while True 和 while 1 是相同的，while False 和 while 0 是相同的。")
m.代码消息(1360, "", "示例代码", "46.2.py")
m.文本消息(137, 130, "看完这段代码是不是豁然开朗，True 和 False 在内部是使用 1 和 0 来表示的。")

# 随机种子
m.文本消息(138, 130, "random 库的使用非常简单，但是为什么我们还要单独来介绍下，因为在同学们做题过程中很容易忽略随机种子的设定而导致输出的结果与实际结果不同。")

m.文本消息(139, "", "今天的课程，就到此结束了，感谢你的学习")
m.文本消息(999, "", '接下来请前往 <a href="https://python123.io/student/courses/3603/groups/43221/intro">本周测验</a>，检验自己的学习成果！')

m.生成消息文件(46)
