from Python123 import MessageCommon

m = MessageCommon()

# 56-01-练习与作业.mp4
m.检查点(10, "1.练习与作业")
m.视频消息(100, '', 'https://video.python123.io/sv/28b44c09-175de05d74b/28b44c09-175de05d74b.mp4')

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>第二部分，课后练习<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
# 课后练习题
# 实例1 身体质量指数BMI
m.检查点(20, "2.身体质量指数BMI")
m.程序设计题(110, "", 6914)  # 程序设计题
m.文本消息(111, "", "课程讲解非常详细，不做过多讲解")

# 实例2 科赫雪花小包裹
m.检查点(30, "3.科赫雪花小包裹")
m.程序设计题(112, "", 6923)  # 程序设计题
m.文本消息(113, "", "课程讲解非常详细，这里不做过多讲解")

# 实例3 任意累积
m.检查点(40, "4.任意累积")
m.程序设计题(114, "", 15213)  # 程序设计题
m.文本消息(115, "", "首先使用input获取用户输入，然后将变量a当做参数传递给format函数，得到字符串类型的cmul(输入值)，最后使用eval函数去除最外层的引号后自动运行函数。")

# 实例4 斐波那契数列
m.检查点(50, "5.斐波那契数列")
m.程序设计题(116, "", 15243)  # 程序设计题
m.文本消息(117, "", "使用基本的递归的方式，很简单。")

# 实例5 汉诺塔实战
m.检查点(60, "6.汉诺塔实战")
m.程序设计题(118, "", 15303)  # 程序设计题
m.文本消息(119, "", "课程讲解详细，前面有汉诺塔的演示视频，同学你理解了么？")

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>第三部分，热点问题<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
m.检查点(70, "7.课程热点问题")
m.分支消息(120, "你还想了解什么问题呢？",
       {"1.第三方库的安装，清华大学源的设置": 121,
        "2.Pyinstaller 打包": 124,
        "3.汉诺塔演示视频": 127,
        "4.递归的关键特征": 129,
        "没有问题了": 132})

# 第三方库的安装，清华大学源
m.文本消息(121, "", "在安装第三方库的时候，很多同学都会因为网络延迟而无法安装，在这里推荐大家设置清华大学的 Pip 源，这样在安装第三方库的时候就不会因为网络延迟而没有安装上了。")
m.图片消息(122, "", "https://python123.io/images/05/e5/cf98850678f943feb64fa920c8a6.jpg")
m.文本消息(123, 120, "配置清华源后速度飞快~")

# Pyinstaller
m.文本消息(124, "", "Pyinstaller 库在打包过程中会使用道ico图标，在搜索引擎中输入.ico图标，就可以搜索到很多相关的网站，选择你喜欢的下载就可以了。")
m.文本消息(125, "", "Pyinstaller 库不支持中文，所以在打包过程中文件和路径名称不要使用中文名称。最关键的一点是，当前的cmd目录一定是要打包的目录，否则无法找到文件。")
m.文本消息(126, 120, "你打包成功了么~")

# 汉诺塔
m.文本消息跳转站外(127, "", "汉诺塔演示视频", "汉诺塔演示视频", "https://www.bilibili.com/video/BV1Ay4y1k7zk/")
m.文本消息(128, 120, "这是一个用 turtle 库绘制的官方演示视频~")

# 递归的关键特征
m.文本消息(129, "", "1.	存在一个或多个基例，基例不需要再次递归，它是确定的表达式")
m.文本消息(130, "", "2.	所有递归链要以一个或多个基例结尾。")
m.文本消息(131, 120, "Python 的默认递归深度是 1000 哟~")

m.文本消息(132, "", "本周的课程，就到此结束了，感谢你的学习！")
m.文本消息(999, "", '接下来请前往 <a href="https://python123.io/student/courses/3603/groups/43222/intro">本周测验</a>，检验自己的学习成果！')

m.生成消息文件(56)
