from Python123 import MessageCommon

m = MessageCommon()

# 62-01-单元开篇.mp4
m.检查点(10, "1.单元开篇")
m.视频消息(100, '', 'https://video.python123.io/sv/1894046d-175de05ebee/1894046d-175de05ebee.mp4')

# 62-02-序列类型定义.mp4
m.检查点(20, "2.序列类型定义")
m.视频消息(200, '', 'https://video.python123.io/sv/39022844-175de05f2b2/39022844-175de05f2b2.mp4')

# 62-03-序列处理函数及方法.mp4
m.检查点(30, "3.序列处理函数及方法")
m.视频消息(300, '', 'https://video.python123.io/sv/2c7b00c-175de05f5d6/2c7b00c-175de05f5d6.mp4')
m.代码消息(301, "", "序列类型操作实例", "62.1.py")

# 62-04-元组类型及操作.mp4
m.检查点(40, "4.元组类型及操作")
m.视频消息(400, '', 'https://video.python123.io/sv/2f4fe046-175de05f601/2f4fe046-175de05f601.mp4')
m.代码消息(401, "", "元组类型及操作 - 1", "62.2.py")
m.代码消息(402, "", "元组类型及操作 - 2", "62.4.py")

# 62-05-列表类型及操作.mp4
m.检查点(50, "5.列表类型及操作")
m.视频消息(500, '', 'https://video.python123.io/sv/175fc519-175de05f8c0/175fc519-175de05f8c0.mp4')
m.代码消息(501, "", "列表类型及操作 - 1", "62.5.py")
m.代码消息(502, "", "列表类型及操作 - 2", "62.6.py")
m.代码消息(503, "", "列表类型及操作 - 3", "62.7.py")

# 62-06-序列类型应用场景.mp4
m.检查点(60, "6.序列类型应用场景")
m.视频消息(600, '', 'https://video.python123.io/sv/48fe8a2a-175de05f8f3/48fe8a2a-175de05f8f3.mp4')
m.代码消息(601, "", "数据保护", "62.8.py")

# 62-07-单元小结.mp4
m.检查点(70, "7.单元小结")
m.视频消息(700, '', 'https://video.python123.io/sv/217821de-175de06000d/217821de-175de06000d.mp4')

m.生成消息文件(62)
