from Python123 import MessageCommon

m = MessageCommon()

# 77-01-作业与练习.mp4
m.检查点(10, "1.作业与练习")
m.视频消息(100, '', 'https://video.python123.io/sv/166563db-175de069626/166563db-175de069626.mp4')

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>第二部分，课后练习<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
# 课后练习题

# 实例1:文件行数
m.检查点(20, "2.课后练习题-文件行数")
m.程序设计题(109, "", 17997)  # 程序设计题
m.文本消息(110, "", "需要注意：for line in f方式获得的每行内容（在变量line中）包含换行符，所以，要通过strip("
                ")函数去掉换行符后再进行统计。如果每行的长度等于0代表这一行是空行就continent跳出当前循环，否则就在全局变量中s加1。")

# 实例2:文件字符分布
m.检查点(30, "3.课后练习题-文件字符分布")
m.程序设计题(111, "", 17998)  # 程序设计题

# 实例3:文件独特行数
m.检查点(40, "4.课后练习题-文件独特行数")
m.程序设计题(112, "", 17999)  # 程序设计题
m.文本消息(113, "", "找到不同行数，那就要用每一行分别和出它以外剩余所有行比较，然后如果剩余所有行中有和它相同的行，那么它就不是独特行，需要跳过。")

# 实例4:csv格式转换
m.检查点(50, "5.课后练习题-csv格式转换")
m.程序设计题(114, "", 19351)  # 程序设计题
m.文本消息(115, "", "在这里会用到列表的一个小技巧，ls[::-1]用来逆序排序")

# 实例5:csv格式数据清洗
m.检查点(60, "6.课后练习题-csv格式数据清洗")
m.程序设计题(116, "", 19350)  # 程序设计题
m.文本消息(117, "", "简单的全文替换功能，replace 替换空文本。")

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>第三部分，热点问题<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
m.检查点(70, "7.课程热点问题")
m.分支消息(126, "课程学习中，同学们关心的热点问题",
       {"1.Wordcloud库安装": 119,
        "结束本节课程": 133})

# Wordcloud库安装
m.文本消息(119, "", "Wordcloud库非常的多同学会安装失败，这时我们就需要下载对应版本的.whl文件进行安装")
m.文本消息(120, "", "登陆网站https://www.lfd.uci.edu/~gohlke/pythonlibs/#wordcloud")
m.图片消息(121, "", "https://python123.io/images/42/3d/6e2f4284213f01bb3a21177dc117.jpg")
m.文本消息(122, "", "发现这么多文件下载那个呢？别着急文件名称中的cp39代表Python3.9版本，cp38代表Python3.8版本，win_amd64代表64位版本的Python，win32代表32位的Python。")
m.文本消息(123, "", "假如我安装的是Python3.8.6版本64位的解释器，那么我就需要下载")
m.图片消息(124, "", "https://python123.io/images/6a/af/7b9ead8e2ae817b4a96d428f8567.jpg")
m.文本消息(125, "", "安装方法打开cmd命令提示符,输入pip install 对应的下载路径安装即可。")
m.文本消息(126, "", "pip install E:\wordcloud-1.4.1-cp38-cp38m-win_amd64.whl")

m.文本消息(133, "", "今天的课程，就到此结束了，感谢你的学习")
m.文本消息(999, "", '接下来请前往 <a href="https://python123.io/student/courses/3603/groups/43224/intro">本周测验</a>，检验自己的学习成果！')

m.生成消息文件(77)
