from Python123 import MessageCommon

m = MessageCommon()

# 92-01-霍兰德人格分析雷达图问题分析.mp4
m.检查点(10, "1.霍兰德人格分析雷达图问题分析")
m.视频消息(100, '', 'https://video.python123.io/sv/13929fb9-175de06ffa1/13929fb9-175de06ffa1.mp4')

# 92-02-霍兰德人格分析雷达图实例展示.mp4
m.检查点(20, "2.霍兰德人格分析雷达图实例展示")
m.视频消息(200, '', 'https://video.python123.io/sv/5d63be30-175de0702c0/5d63be30-175de0702c0.mp4')
m.代码消息(201, "", "霍兰德人格分析雷达图", "92.1.py")

# 92-03-霍兰德人格分析雷达图举一反三.mp4
m.检查点(30, "3.霍兰德人格分析雷达图举一反三")
m.视频消息(300, '', 'https://video.python123.io/sv/5810f630-175de070367/5810f630-175de070367.mp4')

m.生成消息文件(92)
