Repository: pypi-data/pypi-mirror-98
Catalog: packages/cubicweb-conference/cubicweb_conference-0.15.0-py3-none-any.whl/cubicweb_conference/i18n/*.po
Languages: fr

source: Abstract
fr: Résumé

source: Answer the call for talks !
fr: Répondez à l'appel à communication !

source: At the same time
fr: Au même moment

source: Attachments
fr: Pièces jointes

source: Authentication is needed to perform this action
fr: Vous devez vous authentifier pour exécuter cette action

source: Begin
fr: Début

source: Call for paper
fr: Appel à communication

source: Conference
fr: Conférence

source: Conference_plural
fr: Conférences

source: Do you plan to attend a specific talk ? Please click on the attendancy button positionned at the top right of each talk summary.
fr: Prévoyez-vous d'assister à certaines présentations en particulier ? Cliquez sur le bouton que vous trouverez en haut à droite sur chaque page de présentation.

source: End
fr: Fin

source: First talk
fr: Première présentation

source: Generate badges
fr: Générer les badges

source: If you already have an account, please log in
fr: Si vous avez déjà en compte, veuillez vous connecter

source: If you are interested in sponsoring or partnering
fr: Si vous souhaitez sponsoriser cette conférence ou en être partenaire

source: If you do not have an account yet, please create one
fr: Si vous n'avez pas encore de compte, veuillez en créer un

source: Last talk
fr: Dernière présentation

source: Location
fr: Salle

source: New Conference
fr: Nouvelle conférence

source: New Sponsor
fr: Nouveau sponsor

source: New SponsorShip
fr: Nouveau partenariat

source: New Talk
fr: Nouvelle présentation

source: New Track
fr: Nouvelle session

source: No accepted talk yet in this conference
fr: Aucune présentation n'a pour le moment été acceptée pour cette conférence.

source: No accepted talk yet in this track
fr: Aucune présentation n'a pour le moment été acceptée pour cette session.

source: No conference planned for now...
fr: Pas de conférence de prévue pour le moment...

source: No track yet in this conference.
fr: Pas encore de session définie pour cette conférence

source: Number of participant by Talk
fr: Nombre de participants par présentation

source: Past conferences
fr: Conférences précédentes

source: Please, assign a reviewer to :
fr: Merci d'assigner un relecteur à :

source: Presented by
fr: Présenté par

source: Remember you have already submitted a talk.
fr: Rappelez-vous que vous avez déjà déposé une proposition de présentation.

source: Representing
fr: Représentant

source: Speaker
fr: Conférencier

source: SponsorShip
fr: Partenariat

source: SponsorShip_plural
fr: Partenariats

source: Sponsor_plural
fr: Sponsors

source: Talk
fr: Présentation

source: Talk state details
fr: Statut de la présentation

source: Talk title
fr: Titre de la présentation

source: Talk_plural
fr: Présentations

source: Talks you have to review (in state %s)
fr: Les propositions de présentation que vous devez juger (dans l'état %s)

source: The conference was divided into the following tracks:
fr: La conférence était composée des sessions suivantes:

source: The conference will be divided into the following tracks:
fr: La conférence sera composée des sessions suivantes:

source: This Conference
fr: Cette conférence

source: This Sponsor
fr: Ce sponsor

source: This SponsorShip
fr: Ce partenariat

source: This Talk
fr: Cette présentation

source: This Track
fr: Cette session

source: This talk is in state "%s", which means it needs to be submitted before it can be considered by the reviewers.
fr: Cette présentation est dans l'état "%s", ce qui veut dire qu'elle doit être soumise avant de pouvoir être prise en compte par les rapporteurs.

source: This talk is in state "%s", which means the author needs to answer the comments of the reviewers.
fr: Cette présentation est dans l'état "%s", ce qui veut dire que l'auteur doit répondre aux commentaires des rapporteurs.

source: This talk is in state "%s", which means the reviewers will soon send you their comments.
fr: Cette présentation est dans l'état "%s", ce qui veut dire que les rapporteurs vont bientôt vous envoyer leurs commentaires.

source: This talk is in state "%s", which means you have to review it. You can ask the author for modifications, accept or reject this talk.
fr: Cette présentation est dans l'état "%s", ce qui veut dire que vous devez l'évaluer. Vous pouvez demander à l'auteur des modifications, l'accepter ou la rejeter.

source: This talk was reviewed and is now awaiting a final decision by the conference chairs.
fr: Cette proposition a été traitée par les rapporteurs et attend la décision finale des organisateurs.

source: Total talks
fr: Total présentations

source: Track
fr: Session

source: Track title
fr: Titre de la session

source: Track_plural
fr: Sessions

source: Upcoming conferences
fr: Conférences à venir

source: You are planning to attend these talks:
fr: Vous prévoyez d'assister à ces présentations:

source: You do not plan to attend
fr: Vous ne comptez pas y assister.

source: You need to create an account and sign in before you can submit an abstract
fr: Vous devez créer un compte et vous authentifier avant de pouvoir soumettre une proposition de communication.

source: You plan to attend
fr: Vous comptez y assister.

source: Your talks in state %s
fr: Vos présentations dans l'état %s

source: [%s] a talk was added
fr: [%s] ajout d'une présentation

source: [%s] a talk was updated
fr: [%s] modification d'une présentation

source: [%s] talk status was updated
fr: [%s] modification de l'état d'une présentation

source: accept talk
fr: accepter cette présentation

source: accept_pending
fr: en attente d'acceptation

source: accepted
fr: accepté

source: add Talk has_attachments File subject
fr: fichier

source: add Talk in_conf Conference object
fr: présentation

source: add Talk in_track Track object
fr: présentation

source: add Track in_conf Conference object
fr: session

# inlined:Sponsor.has_logo.subject
source: add a File
fr: ajouter un fichier

# inlined:Conference.take_place_at.subject
source: add a PostalAddress
fr: ajouter une adresse

source: adminview
fr: admin

source: archive
fr: archiver

source: archived
fr: archivé

source: ask for correction
fr: demander correction

source: attend
fr: assister

# CWUser
source: attend
fr: assister

# Talk
source: attend_object
fr: Réservation

source: attend_object
fr: Réservation

source: call_open
fr: appel ouvert

source: click here if you do not plan to attend this talk
fr: cliquez ici si vous ne comptez pas assister à cette présentation

source: click here if you plan to attend this talk
fr: cliquer ici si vous souhaitez assister à cette présentation

# Talk
source: comments_object
fr: Commentaire

source: conference workflow
fr: diagramme des états de la conférence

source: confinfo
fr: Informations

source: creating File (Talk %(linkto)s has_attachments File)
fr: Joindre un fichier à la présentation %(linkto)s

source: creating Track (Track in_conf Conference %(linkto)s)
fr: Ajouter une session dans la conférence %(linkto)s

source: draft
fr: brouillon

source: end_on
fr: date de fin

# Conference
source: end_on
fr: heure de fin

source: end_time
fr: heure de fin

# Talk
source: end_time
fr: heure de fin

source: generate badges
fr: générer les badges

source: has_attachments
fr: a des pièces jointes

# Talk
source: has_attachments
fr: lié au fichier

# File
source: has_attachments_object
fr: est lié à l'objet

source: has_attachments_object
fr: a un fichier attaché

source: has_logo
fr: a un logo

# Sponsor
source: has_logo
fr: a un logo

# File
source: has_logo_object
fr: a un logo

source: has_logo_object
fr: a un logo

source: in
fr: dans

source: in room
fr: dans la salle

source: in_conf
fr: est dans la conférence

# Track
source: in_conf
fr: est dans la conférence

# Talk
source: in_conf
fr: est dans la conférence

# Conference
source: in_conf_object
fr: est dans la conférence

source: in_conf_object
fr: est dans la conférence

source: in_track
fr: est dans la session

# Talk
source: in_track
fr: est dans la session

# Track
source: in_track_object
fr: est dans la session

source: in_track_object
fr: est dans la session

source: inreview
fr: en relecture

source: is_sponsor
fr: est sponsor

# Sponsor
source: is_sponsor
fr: est sponsor

source: is_sponsor_object
fr: sponsorise

source: leads
fr: dirige

# CWUser
source: leads
fr: dirige

source: leads_object
fr: dirigé par

source: level
fr: niveau

source: location
fr: lieu

# Talk
source: location
fr: salle

source: need correction
fr: nécessite des corrections

source: on %(sdate)s from %(stime)s to %(etime)s
fr: le %(sdate)s de %(stime)s à %(etime)s

source: one day
fr: un jour

source: people plan to attend
fr: personnes comptent y assister

source: planned
fr: prévu

source: please contact us
fr: veuillez nous contacter

source: reg_open
fr: inscription ouverte

source: reject talk
fr: refuser cette présentation

source: reject_pending
fr: attente de refus

source: rejected
fr: refusé

source: representing
fr: représentant

# CWUser
source: representing
fr: représente

source: resend to reviewer
fr: envoyer à nouveau aux rapporteurs

source: reviews
fr: rapporte

# CWUser
source: reviews
fr: rapporte

source: room
fr: salle

source: schedule
fr: fixer

source: scheduled
fr: fixé

source: select reviewers
fr: Choisir un rapporteur

source: send to reviewer
fr: Envoyer aux rapporteurs

source: start_on
fr: date de début

# Conference
source: start_on
fr: date de début

source: start_time
fr: heure de début

# Talk
source: start_time
fr: heure de début

source: submit your work
fr: soumettre votre travail

source: submitted
fr: soumis

source: take_place_at
fr: a lieu

source: talk workflow
fr: diagramme des états d'une présentation

source: talkslist
fr: Liste des présentations

source: talksschedule
fr: Planning des présentations

# Conference
source: title
fr: titre

# SponsorShip
source: title
fr: titre

# Track
source: title
fr: titre

# Talk
source: title
fr: titre

# Sponsor
source: title
fr: titre

source: trackinfo
fr: description

source: tracktalkslist
fr: présentations

source: tracktalksschedule
fr: programme

source: userconfschedule
fr: programme personnel

source: you are not anymore registered to attend this talk
fr: Vous n'êtes plus inscrit

source: you are now registered to attend this talk
fr: Vous êtes maintenant inscrit

source: your talks
fr: vos présentations
