Repository: pypi-data/pypi-mirror-98
Catalog: packages/pyams-skin/pyams_skin-1.5.0.tar.gz/pyams_skin-1.5.0/src/pyams_skin/locales/*/LC_MESSAGES/pyams_skin.po
Languages: fr

source: Inherit parent skin?
fr: Hériter du skin parent ?

source: Should we reuse parent skin?
fr: Indique si l'on doit hériter du thème graphique du niveau supérieur

source: Don't inherit parent skin?
fr: Ne pas hériter du skin parent ?

source: Should we override parent skin?
fr: Indique que l'on ne doit pas hériter du thème graphique du niveau supérieur

source: Custom graphic theme
fr: Thème graphique spécifique

source: This theme will be used to handle graphic design (colors and images)
fr: Ce thème graphique sera utilisé pour prendre en charge tous les aspects graphiques

source: Custom stylesheet
fr: Feuille de style spécifique

source: This custom stylesheet will be used to override selected theme styles
fr: Cette feuille de style spécifique pourra être utilisée pour surcharger les styles graphiques fournis par le thème sélectionné

source: Editor stylesheet
fr: Feuille de style éditeur

source: Styles defined into this stylesheet will be available into HTML editor
fr: Les styles définis dans cette feuille de style seront disponibles dans l'éditeur HTML

source: Custom script
fr: Script spécifique

source: This custom javascript file will be used to add dynamic features to selected theme
fr: Ce script spécifique pourra être utilisé pour ajouter des comportements à ceux définis par par le thème graphique

source: You must select a custom skin or inherit from parent!
fr: Vous devez sélectionner un thème graphique spécifique si vous n'héritez pas du niveau supérieur

source: Show calendar
fr: Afficher le calendrier

source: Remove selected value
fr: Supprimer la valeur sélectionnée

source: (no selection)
fr: (pas de sélection)

source: Back to previous page
fr: Revenir à la page précédente

source: from
fr: après le

source: to
fr: et avant le
