Repository: pypi-data/pypi-mirror-98
Catalog: packages/m9s-account-*/m9s_account_*-5.2.9-py3-none-any.whl/trytond/modules/account_*/locale/*.po
Languages: de

# field:account.configuration,default_customer_tax_rule:
source: Default Customer Tax Rule
de: Standardsteuerregel Kunden

# field:account.configuration,default_supplier_tax_rule:
source: Default Supplier Tax Rule
de: Standardsteuerregel Lieferanten

# field:account.configuration.default_tax_rule,company:
source: Company
de: Unternehmen

# field:account.configuration.default_tax_rule,create_date:
source: Create Date
de: Erstellungsdatum

# field:account.configuration.default_tax_rule,create_uid:
source: Create User
de: Erstellt durch

# field:account.configuration.default_tax_rule,default_customer_tax_rule:
source: Default Customer Tax Rule
de: Standardsteuerregel Kunden

# field:account.configuration.default_tax_rule,default_supplier_tax_rule:
source: Default Supplier Tax Rule
de: Standardsteuerregel Lieferanten

# field:account.configuration.default_tax_rule,rec_name:
source: Record Name
de: Name

# field:account.configuration.default_tax_rule,write_date:
source: Write Date
de: Zuletzt geändert

# field:account.configuration.default_tax_rule,write_uid:
source: Write User
de: Letzte Änderung durch

# field:tax.advance_turnover_tax_return.context,company:
source: Company
de: Unternehmen

# field:tax.advance_turnover_tax_return.context,end_period:
source: End Period
de: Bis Buchungszeitraum

# field:tax.advance_turnover_tax_return.context,fiscalyear:
source: Fiscal Year
de: Geschäftsjahr

# field:tax.advance_turnover_tax_return.context,show_empty_lines:
source: Show empty lines
de: Leere Zeilen drucken

# field:tax.advance_turnover_tax_return.context,start_period:
source: Start Period
de: Von Buchungszeitraum

# help:tax.advance_turnover_tax_return.context,show_empty_lines:
source: Show/print also lines with zero amount.
de: Auch Zeilen mit Betrag 0 andrucken

# model:account.configuration.default_tax_rule,name:
source: Account Configuration Default Tax Rule
de: Buchhaltung Einstellungen Standardsteuerregel

# model:ir.action,name:act_advance_turnover_tax_return_tree
source: Advance Turnover Tax Return
de: Umsatzsteuervoranmeldung

# model:ir.action,name:report_advance_turnover_tax_return
source: Advance Turnover Tax Return
de: Umsatzsteuervoranmeldung

# model:ir.ui.menu,name:menu_open_advance_turnover_tax_return
source: Advance Turnover Tax Return
de: Umsatzsteuervoranmeldung

# model:tax.advance_turnover_tax_return.context,name:
source: Advance Turnover Tax Return Context
de: Umsatzsteuervoranmeldung Kontext

# report:tax.advance_turnover_tax_return:
source: Advance Turnover Tax Return
de: Umsatzsteuervoranmeldung

# report:tax.advance_turnover_tax_return:
source: Company:
de: Unternehmen:

# report:tax.advance_turnover_tax_return:
source: Fiscal Year:
de: Geschäftsjahr:

# report:tax.advance_turnover_tax_return:
source: From Period:
de: Von Buchungszeitraum:

# report:tax.advance_turnover_tax_return:
source: Print Date:
de: Druckdatum:

# report:tax.advance_turnover_tax_return:
source: To Period:
de: Bis Buchungszeitraum:

# report:tax.advance_turnover_tax_return:
source: User:
de: Benutzer:

# report:tax.advance_turnover_tax_return:
source: at
de: um

# view:account.configuration:
source: Tax Rules
de: Steuerregeln

# view:account.tax.code:
source: Advance Turnover Tax Return
de: Umsatzsteuervoranmeldung

# view:tax.advance_turnover_tax_return.context:
source: Advance Turnover Tax Return
de: Umsatzsteuervoranmeldung
