Repository: pypi-data/pypi-mirror-98
Catalog: packages/feincms3/feincms3-0.90b1-py3-none-any.whl/feincms3/locale/*/LC_MESSAGES/django.po
Languages: nb_no

source: title
nb_no: tittel

source: move
nb_no: flytt

source: Move %s
nb_no: Flytt %s

source: Clone %s
nb_no: Klon %s

source: New location
nb_no: Ny plassering

source: Moving isn't possible because there are no valid targets. Maybe you selected the only root node?
nb_no: Flytting er ikke mulig fordi det ikke er noen gyldige mål. Kanskje du valgte den eneste rotnoden?

source: move here
nb_no: flytt hit

source: The node %(node)s has been moved to the new position.
nb_no: Noden %(node)s har blitt flyttet til ny plassering

source: target
nb_no: mål

source: Replace target's content
nb_no: Erstatt målets innhold

source: Affects the following models: %s.
nb_no: Har innvirkning på følgende moduler: %s.

source: Current: "%s"
nb_no: Nåværende: «%s»

source: Cannot clone node to itself.
nb_no: Kan ikke klone node til seg selv.

source: Updated fields of %(node)s: %(fields)s
nb_no: Oppdaterte felter tilhørende %(node)s:

source: Replaced the content of %(target)s with the contents of %(source)s.
nb_no: Erstattet innholdet i %(target)s med innholdet i %(source)s.

source: ancestor
nb_no: opphav

source: application
nb_no: program

source: app instance namespace
nb_no: programinstans-navnerom

source: This field is required for the application %s.
nb_no: Dette feltet kreves for programmet %s.

source: This exact app already exists.
nb_no: Akkurat dette programmet finnes allerede.

source: menu
nb_no: meny

source: template
nb_no: mal

source: language
nb_no: språk

source: translation of
nb_no: oversettelse av

source: Objects in the primary language cannot be the translation of another object.
nb_no: Objekter i primærspråket kan ikke være oversettelsen av et annet objekt.

source: Objects may only be the translation of objects in the primary language.
nb_no: Objekter kan kun være oversettelser av objekter i primærspråk.

source: Redirect to URL
nb_no: Videresendt til nettadresse

source: Redirect to page
nb_no: Videresendt til side

source: Only set one redirect value.
nb_no: Kun sett én videresendingsverdi.

source: Cannot redirect to self.
nb_no: Kan ikke videresende til seg selv.

source: Do not chain redirects. The selected page "%(title)s" redirects to "%(path)s".
nb_no: Kan ikke opprette videresendelser i stafett. Valgt side «%(title)s» videresender til «%(path)s».

source: Do not chain redirects. The following pages already redirect to this page: %(pages)s
nb_no: Ikke opprett videresendelser i stafett. Følgende sider videresender til denne siden:

source: is active
nb_no: er aktiv

source: Position is expected to be greater than zero.
nb_no: Posisjonen forventes å være større enn null.

source: path
nb_no: sti

source: Generated automatically if 'static path' is unset.
nb_no: Generert automatisk hvis «statisk sti» ikke er valgt.

source: Path must start and end with a slash (/).
nb_no: Sti må starte og slutt med skråstrek (/).

source: static path
nb_no: statisk sti

source: page
nb_no: side

source: pages
nb_no: sider

source: Static paths cannot be empty. Did you mean '/'?
nb_no: Statiske stier må fylles ut. Mente du «/»?

source: The page %(page)s's new path %(path)s would not be unique.
nb_no: Siden «%(page)s» sin nye sti %(path)s finnes allerede.

source: URL
nb_no: Nettadresse

source: external content
nb_no: eksternt innhold

source: Unable to fetch HTML for this URL, sorry!
nb_no: Klarte ikke å hente HTML for denne nettadressen.

source: image
nb_no: bilde

source: image width
nb_no: bildebredde

source: image height
nb_no: bildehøyde

source: primary point of interest
nb_no: hoved-interessepunkt

source: images
nb_no: bilder

source: text
nb_no: tekst

source: template name
nb_no: malnavn

source: snippet
nb_no: tekstsnutt

source: snippets
nb_no: tekstsnutter
